---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
source: html/d0f3240c-7efa-65ab-8789-5ceb02283d52.htm
---
# AssetPropertyDoubleMatrix44 Members

Adds a new connected asset attached to this asset property, if it allows it.